litianling/Documents-Ls1b200/2_龙芯1B_裸机外设/3_龙芯1B_USB驱动设计/1_USB学习设计过程/2_下位机开发/1_键盘_bilibili开源/CH552GUSB自定义键盘/旋转编码器使用EC16的工程/USB/Device/Key.C
                            }
                            else
                            {
                                len = 0xff;                                 //本程序只有2个接口，这句话正常不可能执行
                            }
                            break;
                        default:
                            len = 0xff;                                     //不支持的命令或者出错
                            break;
                        }
                        if ( SetupLen > len )
                        {
                            SetupLen = len;    //限制总长度
                        }
                        len = SetupLen >= 8 ? 8 : SetupLen;                  //本次传输长度
                        memcpy(Ep0Buffer,pDescr,len);                        //加载上传数据
                        SetupLen -= len;
                        pDescr += len;
                        break;
                    case USB_SET_ADDRESS:
                        SetupLen = UsbSetupBuf->wValueL;                     //暂存USB设备地址
                        break;
                    case USB_GET_CONFIGURATION:
                        Ep0Buffer[0] = UsbConfig;
                        if ( SetupLen >= 1 )
                        {
                            len = 1;
                        }
                        break;
                    case USB_SET_CONFIGURATION:
                        UsbConfig = UsbSetupBuf->wValueL;
                        break;
                    case 0x0A:
                        break;
                    case USB_CLEAR_FEATURE:                                            //Clear Feature
                        if ( ( UsbSetupBuf->bRequestType & USB_REQ_RECIP_MASK ) == USB_REQ_RECIP_ENDP )// 端点
                        {
                            switch( UsbSetupBuf->wIndexL )
                            {
                            case 0x82:
                                UEP2_CTRL = UEP2_CTRL & ~ ( bUEP_T_TOG | MASK_UEP_T_RES ) | UEP_T_RES_NAK;
                                break;
                            case 0x81:
                                UEP1_CTRL = UEP1_CTRL & ~ ( bUEP_T_TOG | MASK_UEP_T_RES ) | UEP_T_RES_NAK;
                                break;
                            case 0x01:
                                UEP1_CTRL = UEP1_CTRL & ~ ( bUEP_R_TOG | MASK_UEP_R_RES ) | UEP_R_RES_ACK;
                                break;
                            default:
                                len = 0xFF;                                            // 不支持的端点
                                break;
                            }
                        }
                        else
                        {
                            len = 0xFF;                                                // 不是端点不支持
                        }
                        break;
                    case USB_SET_FEATURE:                                              /* Set Feature */
                        if( ( UsbSetupBuf->bRequestType & 0x1F ) == 0x00 )             /* 设置设备 */
                        {
                            if( ( ( ( UINT16 )UsbSetupBuf->wValueH << 8 ) | UsbSetupBuf->wValueL ) == 0x01 )
                            {
                                if( CfgDesc[ 7 ] & 0x20 )
                                {
                                    /* 设置唤醒使能标志 */
                                }
                                else
                                {
                                    len = 0xFF;                                        /* 操作失败 */
                                }
                            }
                            else
                            {
                                len = 0xFF;                                            /* 操作失败 */
                            }
                        }
                        else if( ( UsbSetupBuf->bRequestType & 0x1F ) == 0x02 )        /* 设置端点 */
                        {
                            if( ( ( ( UINT16 )UsbSetupBuf->wValueH << 8 ) | UsbSetupBuf->wValueL ) == 0x00 )
                            {
                                switch( ( ( UINT16 )UsbSetupBuf->wIndexH << 8 ) | UsbSetupBuf->wIndexL )
                                {
                                case 0x82:
                                    UEP2_CTRL = UEP2_CTRL & (~bUEP_T_TOG) | UEP_T_RES_STALL;/* 设置端点2 IN STALL */
                                    break;
                                case 0x02:
                                    UEP2_CTRL = UEP2_CTRL & (~bUEP_R_TOG) | UEP_R_RES_STALL;/* 设置端点2 OUT Stall */
                                    break;
                                case 0x81:
                                    UEP1_CTRL = UEP1_CTRL & (~bUEP_T_TOG) | UEP_T_RES_STALL;/* 设置端点1 IN STALL */
                                    break;
                                default:
                                    len = 0xFF;                               //操作失败
                                    break;
                                }
                            }
                            else
                            {
                                len = 0xFF;                                   //操作失败
                            }
                        }
                        else
                        {
                            len = 0xFF;                                      //操作失败
                        }
                        break;
                    case USB_GET_STATUS:
                        Ep0Buffer[0] = 0x00;
                        Ep0Buffer[1] = 0x00;
                        if ( SetupLen >= 2 )
                        {
                            len = 2;
                        }
                        else
                        {
                            len = SetupLen;
                        }
                        break;
                    default:
                        len = 0xff;                                           //操作失败
                        break;
                    }
                }
            }
            else
            {
                len = 0xff;                                                   //包长度错误
            }
            if(len == 0xff)
            {
                SetupReq = 0xFF;
                UEP0_CTRL = bUEP_R_TOG | bUEP_T_TOG | UEP_R_RES_STALL | UEP_T_RES_STALL;//STALL
            }
            else if(len <= 8)                                                //上传数据或者状态阶段返回0长度包
            {
                UEP0_T_LEN = len;
                UEP0_CTRL = bUEP_R_TOG | bUEP_T_TOG | UEP_R_RES_ACK | UEP_T_RES_ACK;//默认数据包是DATA1，返回应答ACK
            }
            else
            {
                UEP0_T_LEN = 0;  //虽然尚未到状态阶段，但是提前预置上传0长度数据包以防主机提前进入状态阶段
                UEP0_CTRL = bUEP_R_TOG | bUEP_T_TOG | UEP_R_RES_ACK | UEP_T_RES_ACK;//默认数据包是DATA1,返回应答ACK
            }
            break;
        case UIS_TOKEN_IN | 0:                                               //endpoint0 IN
            switch(SetupReq)
            {
            case USB_GET_DESCRIPTOR:
                len = SetupLen >= 8 ? 8 : SetupLen;                          //本次传输长度
                memcpy( Ep0Buffer, pDescr, len );                            //加载上传数据
                SetupLen -= len;
                pDescr += len;
                UEP0_T_LEN = len;
                UEP0_CTRL ^= bUEP_T_TOG;                                     //同步标志位翻转
                break;
            case USB_SET_ADDRESS:
                USB_DEV_AD = USB_DEV_AD & bUDA_GP_BIT | SetupLen;
                UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;
                break;
            default:
                UEP0_T_LEN = 0;                                              //状态阶段完成中断或者是强制上传0长度数据包结束控制传输
                UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;
                break;
            }
            break;
        case UIS_TOKEN_OUT | 0:  // endpoint0 OUT
            len = USB_RX_LEN;
            if((SetupReq == 0x09)&& (len == 1))
            {
              LED_VALID = Ep0Buffer[0];							
            }
            else if((SetupReq == 0x09) && (len == 8)){//SetReport						 
            }							
            UEP0_T_LEN = 0;  //虽然尚未到状态阶段，但是提前预置上传0长度数据包以防主机提前进入状态阶段
            UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_ACK;//默认数据包是DATA0,返回应答ACK
            break;
        default:
            break;
        }
        UIF_TRANSFER = 0;                                                 //写0清空中断
    }
    if(UIF_BUS_RST)                                                       //设备模式USB总线复位中断
    {
        UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;
        UEP1_CTRL = bUEP_AUTO_TOG | UEP_R_RES_ACK;
        UEP2_CTRL = bUEP_AUTO_TOG | UEP_R_RES_ACK | UEP_T_RES_NAK;
        USB_DEV_AD = 0x00;
        UIF_SUSPEND = 0;
        UIF_TRANSFER = 0;
        UIF_BUS_RST = 0;                                                 //清中断标志
    }
    if (UIF_SUSPEND)                                                     //USB总线挂起/唤醒完成
    {
        UIF_SUSPEND = 0;
    }
    else {                                                               //意外的中断,不可能发生的情况
        USB_INT_FG = 0xFF;                                               //清中断标志
    }
}
/**键盘HID值上传函数**/
void HIDValueHandle1()
{
    //TR0 = 0; //发送前关定时器中断
	FLAG = 0; //清空USB中断传输完成标志，准备发送按键按下数据
	Enp1IntIn(); //USB设备模式端点1的中断上传
	while(FLAG == 0); //等待USB中断数据传输完成
	FLAG = 0; //清空USB中断传输完成标志，准备发送按键抬起数据	
	memset(&HIDKey[0],0,8);	//把HIDkey置0，发送0表示按键抬起
	Enp1IntIn(); //USB设备模式端点1的中断上传		
	while(FLAG == 0); //等待USB中断数据传输完成
	//TR0 = 1; //发送完打开定时器中断		
}
/**多媒体按键HID值上传函数**/
void HIDValueHandle2()
{
    //TR0 = 0; //发送前关定时器中断
	FLAG = 0; //清空USB中断传输完成标志，准备发送按键按下数据
	Enp2IntIn(); //USB设备模式端点2的中断上传
	while(FLAG == 0); //等待USB中断数据传输完成
	FLAG = 0; //清空USB中断传输完成标志，准备发送按键抬起数据	
	memset(&HIDKeyMUL[0],0,4); //把HIDKeyMUL置0，发送0表示按键抬起
	Enp2IntIn(); //USB设备模式端点2的中断上传		
	while(FLAG == 0); //等待USB中断数据传输
	//TR0 = 1; //发送完打开定时器中断		
}
/**按键行为函数**/
/*找到按键的HID值自由发挥部分*/
/*普通按键
  例如ctrl + c :
  HIDKey[0] = 0x01;
  HIDKey[2] = 0x06;
  if(Ready) //枚举成功
	{
	    HIDValueHandle1();
	}
*/
/* 按键动作函数 */
void KeyAction(unsigned char keyCode)
{   
	if(keyCode == 0x31)//按键1
	{
	    HIDKeyMUL[0] = 0x10;  //打开媒体播放器
		if(Ready) //枚举成功
        {
            HIDValueHandle2(); //多媒体按键HID值上传
        }
	}
	if(keyCode == 0x32)//按键2
	{
		HIDKeyMUL[1] = 0x01;  //下一曲
		if(Ready) //枚举成功
        {
            HIDValueHandle2(); //多媒体按键HID值上传
        }
	}
	if(keyCode == 0x33)	//按键3	
	{
		HIDKeyMUL[0] = 0x80;  //上一曲
		if(Ready) //枚举成功
        {
            HIDValueHandle2(); //普通按键HID值上传
        }
	}
	if(keyCode == 0x34)	//按键4	
	{
		HIDKeyMUL[0] = 0x40; //播放/暂停

		if(Ready) //枚举成功
        {
            HIDValueHandle2(); //多媒体按键HID值上传
        }
	}
	if(keyCode == 0x35)	//按键5	
	{
		HIDKeyMUL[0] = 0x02; //音量+

		if(Ready) //枚举成功
        {
            HIDValueHandle2(); //多媒体按键HID值上传
        }
	}
	if(keyCode == 0x36)	//按键6	
	{
		HIDKeyMUL[0] = 0x01; //音量-

		if(Ready) //枚举成功
        {
            HIDValueHandle2(); //多媒体按键HID值上传
        }
	}
}
/**按键驱动**/
void KeyDrive()
{
	unsigned char j;

	for(j=0;j<4;j++)
	{
		if(KeyState[j] != BackState[j])
		{
	    	if(BackState[j] != 0)
			{
				KeyAction(key_code_map[j]);
			}
			BackState[j] = KeyState[j]; 
		}
		if(KeyDownTime[j] > 0)
		{
			if(KeyDownTime[j] >= TimeThr[j])
			{
				KeyAction(key_code_map[j]);
				TimeThr[j] += 100;
			} 
		}
		else
		{
			TimeThr[j] = 1000;
		}		
	}
}
/**EC16驱动**/
/*顺时针旋转按键5，逆时针旋转按键6*/
void EC16Drive()
{
	EC16_A_State = EC16_A;	//读取EC16_A状态
	if(EC16_A_State != EC16_A_PState)
	{
	   if(EC16_A_State == 1) //顺时针旋转
	   {
	      if(EC16_B == 0) //判断EC16_B状态
		  {
		  	  KeyAction(key_code_map[4]);
		  }
		  else
		  {
			  KeyAction(key_code_map[5]);
		  }
	   }
	   else	//逆时针旋转
	   {
		  if(EC16_B  == 1)//判断EC16_B状态
		  {
		  	  KeyAction(key_code_map[4]);
		  }
		  else
		  {
			  KeyAction(key_code_map[5]);
		  }
	   }
	   EC16_A_PState = EC16_A_State;
	}
}
/**T0配置函数**/
void ConfigT0(UINT8 ms)
{
    unsigned long tmp = 0;

	tmp = 12000000/12;
	tmp = (tmp * ms)/1000;
	tmp = 65536 - tmp;
	tmp = tmp + 1;
    T0RH = (UINT8)(tmp >> 8);
	T0RL = (UINT8)tmp;

	TMOD = ( TMOD & ~( bT0_GATE | bT0_CT | bT0_M1 ) ) | bT0_M0;//* 模式1，16 位定时/计数器
	TH0 = T0RH;
	TL0 = T0RL;
	TF0 = 0;
	ET0 = 1;
	TR0 = 1;
}
/*****************主函数**********************/
main()
{
    CfgFsys(); //CH552时钟选择12M配置
    mDelaymS(5); //修改主频等待内部晶振稳定,必加	
	ConfigT0(10); //配置10ms T0中断
	USBDeviceInit(); //USB设备模式初始化
    EA = 1; //允许单片机中断
    UEP1_T_LEN = 0; //预使用发送长度一定要清空
  	UEP2_T_LEN = 0;	//清空端点2发送长度
    FLAG = 0; //清空USB中断传输完成标志
    Ready = 0;
	LED_VALID = 1;   //给一个默认值

	key1 = 1;
	key2 = 1;
	key3 = 1;
	key4 = 1;
	EC16_A = 1;
	EC16_B = 1;

	while(1)
	{
	    KeyDrive();	//按键驱动
   		EC16Drive();//EC16驱动
	}
}
/**按键扫描函数**/
void KeyScan()
{
	UINT8 i;
	static UINT8 keybuffer[4] = {0xFF,0xFF,0xFF,0xFF};

	keybuffer[0] = (keybuffer[0] <<1) | key1;//按键扫描
	keybuffer[1] = (keybuffer[1] <<1) | key2;
	keybuffer[2] = (keybuffer[2] <<1) | key3;
	keybuffer[3] = (keybuffer[3] <<1) | key4;
	
	for(i=0;i<4;i++)
	{
		if((keybuffer[i] & 0x0F) == 0x00)
		{
			KeyState[i] = 0;
			if(i>=3)
			    break;
			KeyDownTime[i] += 4;  //按下的持续时间累加
		}
		else if((keybuffer[i] & 0x0F) == 0x0F)
		{
			KeyState[i] = 1;
			if(i>=3)
			    break;
			KeyDownTime[i] = 0;   //按下的持续时间清零
		}
	} 

}
/**T0中断函数**/
void InterruptTimer0() interrupt INT_NO_TMR0 using 1 
{
	TH0 = T0RH;
	TL0 = T0RL;

	KeyScan(); //按键扫描
}

